(function () {
    function renderData(data) {
        var template = $('#data-list').html();
        Mustache.parse(template);   // optional, speeds up future uses
        var rendered = Mustache.render(template, {data: data});
        $('#data-list').html(rendered);
    };

    function getData(params, cb) {
        var data = [{
            name: 'Правило 1 – Съдии, секретарски апарат: Права и задължения',
            data: [{
                name: 'Чл. 1 Съдии, секретарски апарат и комисар',
                data: [{
                    name: '1.1 Съдиите са старши-съдията и 1 или 2 съдии. Те са подпомагани от секретарски \n' +
                    'апарат и от комисар, ако е налице такъв.'
                }, {
                    name: '1.2 Секретарският  апарат се състои от секретар, помощник-секретар, \n' +
                    'времеизмервач и времеизмервач на 24 секунди.'
                }, {
                    name: '1.3 Комисарят \n' +
                    'седи  на  секретарската  маса  между  се\n' +
                    'кретаря  и  времеизмервача. \n' +
                    'Основната  му  задача  е  да  упражнява \n' +
                    'контрол\n' +
                    'върху  работата  на  секретарския \n' +
                    'апарат  и  да  подпомага  старши  съдията  и  съ\n' +
                    'диите \n' +
                    'за  гладко  протичане  на \n' +
                    'срещата\n' +
                    '.'
                }, {
                    name: '1.4 Съдиите на дадена среща\n' +
                    'не трябва да бъдат свър\n' +
                    'зани по какъвто и да е начин \n' +
                    'с някой от отборите на игралното поле.'
                }, {
                    name: '1.5 Съдиите, секретарският апарат и комисарят ръ\n' +
                    'ководят срещата, спазвай\n' +
                    'ки \n' +
                    'настоящите прави\n' +
                    'ла и нямат право да \n' +
                    'да ги променят\n' +
                    '. '
                }],
            }, {
                name: 'Чл. 2 Времеизмервач на 24 секунди: Задължения',
                data: [
                    {
                        name: 'Времеизмервачът на 24 се\n' +
                        'кунди трябва да има на свое разположение часовник \n' +
                        'за 24 секунди и да го управлява така, че същият:'
                    }, {
                        name: '2.1 Да бъде пуснат или да бъде пуснат отново, когато:'
                    }, {
                        name: '• отбор овладее “жива” топка на игралното поле\n' +
                        '. Незначителното докосване на \n' +
                        'топката от противник не стартира нов период на часовника за\n' +
                        '24 секунди, ако \n' +
                        'топката остава във владение на същият отбор;'
                    }, {
                        name: '•при  вкарване  на  топка  в  игра  отвън,  тя  докосне  или  е  редовно  докосната  от \n' +
                        'кой да е състезател в игралното поле.'
                    }, {
                        name: '2.2 Се спира и се връща на 14 секунди. когато:'
                    }, {
                        name: '•на  отбора,  който  е  бил  във  владение  на  топката  преди  това  се  дава  право \n' +
                        'да вкара топката в игра отвън в предното си поле и 13 или по-малко секунди \n' +
                        'са налице на таблото на часовника за 24 секунди:'
                    }
                ]
            }]
        }];

        cb(data);
    };

    getData({}, renderData);

    $('.data-list-header').click(function () {
        $(this).next().toggleClass('hidden');
    });

    $('#toggle-btn').click(function (ev) {
        ev.preventDefault()
        $('.data-list-items').toggleClass('hidden');
    });
})();
