(function () {
    function renderData(data) {
        var template = $('#data-list').html();
        Mustache.parse(template);   // optional, speeds up future uses
        var rendered = Mustache.render(template, {data: data});
        $('#data-list').html(rendered);
    };

    function getData(params, cb) {
        var data = [{
            name: 'Правило 1 – Правила на играта',
            data: [{
                name: 'Чл. 1 Времетраене на играта, равен резултат и продължения',
                data: [{
                    name: '1.1. Играта се състои от 4 периода по 10 минут всеки един от тях.'
                }, {
                    name: '1.2. Трябва да има нтервал от 20 минути преди планираното начало на срещата.'
                }, {
                    name: '1.3. Интервали  в  играта  от  2  минути  има  между  първия  и  втория  период  (първо полувреме), между третия и четвъртия период (второ полувреме), както и преди всяко продължение.'
                }, {
                    name: '1.4. Почивката между полувремената е 15 минути.'
                }, {
                    name: '1.5. Интервал в играта започва:',
                }, {
                    name: '• 20 минути преди планираното начало на срещата;'
                }, {
                    name: ' • когато прозвучи сигналът за край на игралното време на даден период.'
                }, {
                    name: '1.6. Интервал от играта завършва:',
                }, {
                    name: '• в  началото  на  първия  период,  когато  топката  напусне  ръката  или  ръцете  на старши-съдията при изпълнението на спорната топка;'
                }, {
                    name: '• в началото на всички останали периоди, когато топката е на разположение на състезателя, който ще я вкара в игра отвън .'
                }]
            }]
        }, {
            name: 'Правило 2 – Грешки',
            data: [{
                name: 'Чл. 2 Водене на топката (дриблиране)',
                data: [{
                    name: '2.1. Дефиниция'
                }, {
                    name: '2.1.1 Дриблирането \n' +
                    'е  движението  на  “жива  топка”,  предизвикано  от  състезател, придобил  владението  й\n' +
                    ',  който я хвърля, тупка,  отплесва  или  търкаля  по  пода. \n' +
                    'Умишленото  хвърляне  на  топката  в  таблото  се  счита  за  водене  на  топката (дриблиране)'
                }, {
                    name: '2.1.2 Воденето на  топката започва,  когато  състезател,  придобил  владение  на “жива” \n' +
                    'топка я тупка,  отплесва, търкаля  по  пода  или  умишлено  хвърля  топката  в \n' +
                    'таблото и отново я докосва преди тя да е докоснала друг състезател.\n' +
                    'Воденето  на  топката завършва в  момента,  когато  състезателят  докосне топката ед\n' +
                    'новременно с двете си ръце или ако допусне топката да се задържи в едната или двете му ръце.\n' +
                    'По време на воденето на топката, тя може да бъде хвърляна във въздуха, при условие,  че  докосне  по\n' +
                    'да  или  друг  състезател  преди  състезателят,  който  я  е хвърлил да я докосне отново с ръката си.\n'
                }, {
                    name: '2.1.3. Налице   е   положение   на   неовладяна   топка (изпусната), когато   състезател \n' +
                    'неволно загуби и след това възстанови контрола си на “жива” топка в игралното  поле'
                }, {
                    name: '2.2. Правило '
                }, {
                    name: 'След като завърши дрибъла си, състезателят няма право да дриблира повторно, \n' +
                    'освен ако това стане след като вече е загубил владение на топката вследствие на:\n'
                }, {
                    name:'•стрелба в коша от игра;'
                }, {
                    name: '•докосване на топката от противник;'
                }, {
                    name: '•подаване   или   положение   на   неовладяна   топка,   при   което   топката   е докоснала или е' +
                    ' била докосната от друг състезател.'
                }]
            }, {
                name: 'Чл. 3 Придвижване с топката (крачки)',
                data: [{
                    name: '3.1. Дефиниция',
                }, {
                    name: '3.1.1. Неразрешеното  движение  на  единия  или  двата  кра\n' +
                    'ка  на  състезател  в  някоя \n' +
                    'посока,  докато  същият  държи\n' +
                    '“жива”  топка  на  игралното  поле,  неспазвайки \n' +
                    'указанията, изложени в \n' +
                    'насотящият член\n' +
                    ', се счита за \n' +
                    'неправилно придвиж\n' +
                    'ване \n' +
                    'или крачки\n' +
                    '.'
                }, {
                    name: '3.1.2 Обръщане  с  топката  или  пивотиране \n' +
                    'е   разреше\n' +
                    'ното   движение,   когато \n' +
                    'състезател, държащ “жива” топка в игралното поле п\n' +
                    'ристъпва един или повече \n' +
                    'пъти с \n' +
                    'един и същи крак в произволна посока, като същевременно държи другия \n' +
                    'си  крак,\n' +
                    'наречен  пиво\n' +
                    'тиращ,  опрян  до  пода,  без  да  го  отделя  от  допирна\n' +
                    'та  му \n' +
                    'точка.'
                }]
            }]
        }];

        cb(data);
    };

    getData({}, renderData);

    $('.data-list-header').click(function () {
        $(this).next().toggleClass('hidden');
    });

    var hidden = false;
    $('#toggle-btn').click(function (ev) {
        ev.preventDefault()
        hidden ? $('.data-list-items').removeClass('hidden') : $('.data-list-items').addClass('hidden');
        hidden = !hidden;
    });
})();
